# Задача 1

list = [('1, 2, 3'), range(5), {1, 5}, 'срока', (1, 15)]
for i, item in enumerate(list, 1):
    print(f'{i} - {type(item)}')

# Задача 2 - нет решения

# Задача 3

month = int(input('Введите месяц от 1 до 12:'))

month_dict = {1: 'январь', 2: 'февраль', 3: 'март', 4: 'апрель', 5: 'май', 6: 'июнь', 7: 'июль', 8: 'август',
              9: 'сентябрь', 10: 'октябрь', 11: 'ноябрь', 12: 'декабрь'}
month_list = ['январь', 'февраль', 'март', 'апрель', 'май', 'июнь', 'июль', 'август', 'сентябрь', 'октябрь', 'ноябрь',
              'декабрь']

if month in month_dict:
    print(f'{month} месяц - это {month_dict[month]}')
    print(f'{month} месяц - это {month_list[month - 1]}')
else:
    print('Не найден')

# Задача 4 - нет решения
# Задача 5 - нет решения
# Задача 6 - нет решения

